Конфигурация/DataProcessors/КонтрольОтклоненияСЧА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>КонтрольОтклоненияСЧА</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьУспешноПрошедшихКонтроль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДатыДляСверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентОтклоненияСЧА</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатистикаРаботыВнутреннихМеханизмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаРаботыВнутреннихМеханизмов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачалоМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончаниеМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СессияЗавершенаСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Механизм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаВыполнения</Name>
					<Comment>Должна соответствовать дате из ПериодВыполненияНачало. Служит для групповой обработки записей</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ДанныеКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКалендаря</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПереноса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ФинансовыеПоказатели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФинансовыеПоказатели</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПоказателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыФинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ВводыВыводыАктивовВВалютеУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ВводыВыводыАктивовВВалютеУчета</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БалансоваяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РыночнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАктива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперацииВводаВыводаДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/DataProcessors/КонтрольОтклоненияСЧА/Ext/ObjectModule.bsl
#Область Интерфейс

Процедура ВыполнитьМетод(Метод, Экземпляры) Экспорт
	
	Если Метод = "ВыполнитьОповещение" Тогда
		ВыполнитьОповещение(Экземпляры);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОтчетОПроверке() Экспорт
	
	Результат = ВывестиРезультатПроверкиВТабличныйДокумент(ПроверитьСписокДоговоров());
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьСписокДоговоров() Экспорт
	
	// Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = ПолучитьПараметрыВыполненияДляСбораСтатистики();
	Механизм = "Обработка.КонтрольОтклоненияСЧА";
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Результат = Новый ТаблицаЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ПолучитьТекстЗапросаДляПроверкиСЧА();
	
	Запрос.УстановитьПараметр("Организация",						Организация);
	Запрос.УстановитьПараметр("НачалоПериода",						Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",						Период.ДатаОкончания);
	Запрос.УстановитьПараметр("СчетаДоверительногоУправления",		Список.ВыгрузитьКолонку("СчетДоверительногоУправления"));
	Запрос.УстановитьПараметр("ИсключитьУспешноПрошедшихКонтроль",	ИсключитьУспешноПрошедшихКонтроль);
	Запрос.УстановитьПараметр("ВариантДатыДляСверки",				ВариантДатыДляСверки);
	Запрос.УстановитьПараметр("ПроцентОтклоненияСЧА",				ПроцентОтклоненияСЧА);
	Запрос.УстановитьПараметр("ПроцентОтклоненияСЧАСтрокой",		Формат(ПроцентОтклоненияСЧА, ""));
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

Функция ВывестиРезультатПроверкиВТабличныйДокумент(РезультатПроверки)
	
	Макет = ПолучитьМакет("РезультатПроверки");
	
	ОбластьШапка				= Макет.ПолучитьОбласть("Шапка");
	ОбластьПодвал				= Макет.ПолучитьОбласть("Подвал");
	ОбластьСтрокаДа				= Макет.ПолучитьОбласть("СтрокаДа");
	ОбластьСтрокаНеПроводилась	= Макет.ПолучитьОбласть("СтрокаНеПроводилась");
	ОбластьСтрокаНет			= Макет.ПолучитьОбласть("СтрокаНет");
	
	Результат = Новый ТабличныйДокумент;
	
	Результат.Вывести(ОбластьШапка);
	
	Для Каждого ТекСтрока Из РезультатПроверки Цикл
		
		Если ТекСтрока.Результат = 2 Тогда
			Область = ОбластьСтрокаДа;
		ИначеЕсли ТекСтрока.Результат = 1 Тогда
			Область = ОбластьСтрокаНеПроводилась;
		Иначе
			Область = ОбластьСтрокаНет;
		КонецЕсли;
		
		Область.Параметры.Заполнить(ТекСтрока);
		
		Результат.Вывести(Область);
		
	КонецЦикла;
	
	Результат.Вывести(ОбластьПодвал);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТекстЗапросаДляПроверкиСЧА()
	
	Возврат
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК Дата
		|ПОМЕСТИТЬ _Даты
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СДУ,
		|	_Даты.Дата КАК Дата
		|ПОМЕСТИТЬ _СДУ
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Даты КАК _Даты
		|		ПО (ИСТИНА)
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И СчетаДоверительногоУправления.Ссылка В(&СчетаДоверительногоУправления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФинансовыеПоказатели.СубъектАналитики КАК СДУ,
		|	ФинансовыеПоказатели.Период КАК Период,
		|	ФинансовыеПоказатели.Значение КАК СЧА
		|ПОМЕСТИТЬ _ДанныеРегистра
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|ГДЕ
		|	ФинансовыеПоказатели.Период <= &КонецПериода
		|	И (ФинансовыеПоказатели.Организация, ФинансовыеПоказатели.ВидПоказателя, ФинансовыеПоказатели.СубъектАналитики) В
		|			(ВЫБРАТЬ
		|				&Организация КАК Организация,
		|				ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок) КАК ВидПоказателя,
		|				_СДУ.СДУ КАК СДУ
		|			ИЗ
		|				_СДУ КАК _СДУ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФинансовыеПоказатели.СубъектАналитики КАК СДУ,
		|	МИНИМУМ(ФинансовыеПоказатели.Период) КАК ДатаПервойСЧА
		|ПОМЕСТИТЬ _ДатыПервыхСЧА
		|ИЗ
		|	РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|ГДЕ
		|	(ФинансовыеПоказатели.Организация, ФинансовыеПоказатели.ВидПоказателя, ФинансовыеПоказатели.СубъектАналитики) В
		|			(ВЫБРАТЬ
		|				&Организация КАК Организация,
		|				ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок) КАК ВидПоказателя,
		|				_СДУ.СДУ КАК СДУ
		|			ИЗ
		|				_СДУ КАК _СДУ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ФинансовыеПоказатели.СубъектАналитики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеРегистра.СДУ КАК СДУ,
		|	_ДанныеРегистра.Период КАК Период,
		|	_ДанныеРегистра.СЧА КАК СЧА
		|ПОМЕСТИТЬ _СЧА
		|ИЗ
		|	_ДанныеРегистра КАК _ДанныеРегистра
		|ГДЕ
		|	_ДанныеРегистра.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СЧА.СДУ КАК СДУ,
		|	_СЧА.Период КАК Период,
		|	МАКСИМУМ(_ДанныеРегистра.Период) КАК ПериодДляСверки
		|ПОМЕСТИТЬ _ДатыДляСверки
		|ИЗ
		|	_СЧА КАК _СЧА
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеРегистра КАК _ДанныеРегистра
		|		ПО _СЧА.СДУ = _ДанныеРегистра.СДУ
		|			И (ВЫБОР
		|				КОГДА &ВариантДатыДляСверки = ""КонецПредыдущегоМесяца""
		|					ТОГДА НАЧАЛОПЕРИОДА(&НачалоПериода, МЕСЯЦ) > _ДанныеРегистра.Период
		|				ИНАЧЕ _СЧА.Период > _ДанныеРегистра.Период
		|			КОНЕЦ)
		|
		|СГРУППИРОВАТЬ ПО
		|	_СЧА.СДУ,
		|	_СЧА.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СДУ.СДУ КАК СДУ,
		|	_СДУ.Дата КАК Дата,
		|	_СЧА.СЧА КАК СЧА,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ФинансовыеПоказатели.Регистратор) = 1
		|			ТОГДА МАКСИМУМ(ФинансовыеПоказатели.Регистратор)
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК РасшифровкаСЧА,
		|	ВЫБОР
		|		КОГДА _ДатыПервыхСЧА.СДУ ЕСТЬ NULL
		|			ТОГДА _ДанныеРегистра.СЧА
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СЧАДляСверки,
		|	_ДатыДляСверки.ПериодДляСверки КАК ДатаДляСверки,
		|	ВЫБОР
		|		КОГДА КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ФинансовыеПоказателиДляСверки.Регистратор) = 1
		|			ТОГДА МАКСИМУМ(ФинансовыеПоказателиДляСверки.Регистратор)
		|		ИНАЧЕ NULL
		|	КОНЕЦ КАК РасшифровкаСЧАДляСверки
		|ПОМЕСТИТЬ _ДанныеПоСЧА
		|ИЗ
		|	_СДУ КАК _СДУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ _СЧА КАК _СЧА
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ДатыДляСверки КАК _ДатыДляСверки
		|				ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеРегистра КАК _ДанныеРегистра
		|				ПО _ДатыДляСверки.СДУ = _ДанныеРегистра.СДУ
		|					И _ДатыДляСверки.ПериодДляСверки = _ДанныеРегистра.Период
		|			ПО _СЧА.СДУ = _ДатыДляСверки.СДУ
		|				И _СЧА.Период = _ДатыДляСверки.Период
		|		ПО _СДУ.СДУ = _СЧА.СДУ
		|			И _СДУ.Дата = _СЧА.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыПервыхСЧА КАК _ДатыПервыхСЧА
		|		ПО _СДУ.СДУ = _ДатыПервыхСЧА.СДУ
		|			И _СДУ.Дата = _ДатыПервыхСЧА.ДатаПервойСЧА
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказатели
		|		ПО _СДУ.Дата = ФинансовыеПоказатели.Период
		|			И (ФинансовыеПоказатели.Организация = &Организация)
		|			И (ФинансовыеПоказатели.СубъектАналитики = _СДУ.СДУ)
		|			И (ФинансовыеПоказатели.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И (ФинансовыеПоказатели.Регистратор ССЫЛКА Документ.РегистрацияСтоимостиАктивов)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыеПоказатели КАК ФинансовыеПоказателиДляСверки
		|		ПО (_ДатыДляСверки.ПериодДляСверки = ФинансовыеПоказателиДляСверки.Период)
		|			И (ФинансовыеПоказателиДляСверки.Организация = &Организация)
		|			И (ФинансовыеПоказателиДляСверки.СубъектАналитики = _СДУ.СДУ)
		|			И (ФинансовыеПоказателиДляСверки.ВидПоказателя = ЗНАЧЕНИЕ(Справочник.ВидыФинансовыхПоказателей.СтоимостьЧистыхАктивов_Рынок))
		|			И (ФинансовыеПоказателиДляСверки.Регистратор ССЫЛКА Документ.РегистрацияСтоимостиАктивов)
		|
		|СГРУППИРОВАТЬ ПО
		|	_СДУ.СДУ,
		|	_СДУ.Дата,
		|	_СЧА.СЧА,
		|	ВЫБОР
		|		КОГДА _ДатыПервыхСЧА.СДУ ЕСТЬ NULL
		|			ТОГДА _ДанныеРегистра.СЧА
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	_ДатыДляСверки.ПериодДляСверки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеПоСЧА.СДУ КАК СДУ,
		|	_ДанныеПоСЧА.Дата КАК Дата,
		|	СУММА(ВЫБОР
		|			КОГДА ВводыВыводыАктивовВВалютеУчета.НаправлениеДвижения ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ВводыВыводыАктивовВВалютеУчета.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|						ТОГДА -1
		|					ИНАЧЕ 1
		|				КОНЕЦ * ВводыВыводыАктивовВВалютеУчета.РыночнаяСтоимость
		|		КОНЕЦ) КАК ВводыВыводы
		|ПОМЕСТИТЬ _ВводыВыводы
		|ИЗ
		|	_ДанныеПоСЧА КАК _ДанныеПоСЧА
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыВыводыАктивовВВалютеУчета
		|		ПО _ДанныеПоСЧА.СДУ = ВводыВыводыАктивовВВалютеУчета.СчетДоверительногоУправления
		|			И (НАЧАЛОПЕРИОДА(ВводыВыводыАктивовВВалютеУчета.Период, ДЕНЬ) > _ДанныеПоСЧА.ДатаДляСверки)
		|			И (НАЧАЛОПЕРИОДА(ВводыВыводыАктивовВВалютеУчета.Период, ДЕНЬ) <= _ДанныеПоСЧА.Дата)
		|			И (_ДанныеПоСЧА.СДУ.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
		|				ИЛИ НЕ ВводыВыводыАктивовВВалютеУчета.ВидОперацииВводаВыводаДС В (ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПайщика), ЗНАЧЕНИЕ(Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПайщику)))
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДанныеПоСЧА.СДУ,
		|	_ДанныеПоСЧА.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеПоСЧА.СДУ КАК СДУ,
		|	_ДанныеПоСЧА.Дата КАК Дата,
		|	СУММА(ЕСТЬNULL(ЗадолженностиПоДенежнымСредствам.Сумма, 0)) КАК Сумма
		|ПОМЕСТИТЬ _ЗадолженностиПоКомиссии
		|ИЗ
		|	_ДанныеПоСЧА КАК _ДанныеПоСЧА
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|		ПО _ДанныеПоСЧА.СДУ = ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления
		|			И (НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствам.Период, ДЕНЬ) > _ДанныеПоСЧА.ДатаДляСверки)
		|			И (НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствам.Период, ДЕНЬ) <= _ДанныеПоСЧА.Дата)
		|			И (ЗадолженностиПоДенежнымСредствам.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская))
		|			И (ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющегоПлатаЗаРазмещение))
		|			И (ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДанныеПоСЧА.СДУ,
		|	_ДанныеПоСЧА.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеПоСЧА.СДУ КАК СДУ,
		|	_ДанныеПоСЧА.Дата КАК Дата,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствам.Сумма ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|						ТОГДА -1
		|					ИНАЧЕ 1
		|				КОНЕЦ * ЗадолженностиПоДенежнымСредствам.Сумма
		|		КОНЕЦ) КАК ВыдачаПаев
		|ПОМЕСТИТЬ _ЗадолженностиПИФ
		|ИЗ
		|	_ДанныеПоСЧА КАК _ДанныеПоСЧА
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|		ПО _ДанныеПоСЧА.СДУ = ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления
		|			И (ЗадолженностиПоДенежнымСредствам.Организация = &Организация)
		|			И (ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПередПайщиками))
		|			И (НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствам.Период, ДЕНЬ) > _ДанныеПоСЧА.ДатаДляСверки)
		|			И (НАЧАЛОПЕРИОДА(ЗадолженностиПоДенежнымСредствам.Период, ДЕНЬ) <= _ДанныеПоСЧА.Дата)
		|			И (ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|					И ЗадолженностиПоДенежнымСредствам.Аванс
		|				ИЛИ ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					И НЕ ЗадолженностиПоДенежнымСредствам.Аванс)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ДанныеПоСЧА.Дата,
		|	_ДанныеПоСЧА.СДУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеПоСЧА.СДУ КАК СчетДоверительногоУправления,
		|	_ДанныеПоСЧА.Дата КАК Дата,
		|	_ДанныеПоСЧА.ДатаДляСверки КАК ДатаДляСверки,
		|	ВЫБОР
		|		КОГДА _ДанныеПоСЧА.СЧА ЕСТЬ NULL
		|			ТОГДА 1
		|		КОГДА _ДанныеПоСЧА.СЧАДляСверки ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|					КОГДА _ДанныеПоСЧА.СЧА = 0
		|						ТОГДА 2
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА _ДанныеПоСЧА.СЧАДляСверки = 0
		|					ТОГДА 2
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВЫБОР
		|								КОГДА _ДанныеПоСЧА.СЧА + _ВводыВыводы.ВводыВыводы + _ЗадолженностиПоКомиссии.Сумма + _ЗадолженностиПИФ.ВыдачаПаев > _ДанныеПоСЧА.СЧАДляСверки
		|									ТОГДА (_ДанныеПоСЧА.СЧА + _ВводыВыводы.ВводыВыводы + _ЗадолженностиПоКомиссии.Сумма + _ЗадолженностиПИФ.ВыдачаПаев - _ДанныеПоСЧА.СЧАДляСверки) / _ДанныеПоСЧА.СЧАДляСверки
		|								ИНАЧЕ (_ДанныеПоСЧА.СЧАДляСверки - (_ДанныеПоСЧА.СЧА + _ВводыВыводы.ВводыВыводы + _ЗадолженностиПоКомиссии.Сумма + _ЗадолженностиПИФ.ВыдачаПаев)) / _ДанныеПоСЧА.СЧАДляСверки
		|							КОНЕЦ > &ПроцентОтклоненияСЧА / 100
		|							ТОГДА 0
		|						ИНАЧЕ 2
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Результат,
		|	_ДанныеПоСЧА.СЧА КАК СЧА,
		|	_ДанныеПоСЧА.СЧАДляСверки КАК СЧАДляСверки,
		|	-_ВводыВыводы.ВводыВыводы - _ЗадолженностиПИФ.ВыдачаПаев - _ЗадолженностиПоКомиссии.Сумма КАК ВводыВыводы,
		|	_ДанныеПоСЧА.РасшифровкаСЧА КАК РасшифровкаСЧА,
		|	_ДанныеПоСЧА.РасшифровкаСЧАДляСверки КАК РасшифровкаСЧАДляСверки
		|ПОМЕСТИТЬ _Итоговая
		|ИЗ
		|	_ДанныеПоСЧА КАК _ДанныеПоСЧА
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ВводыВыводы КАК _ВводыВыводы
		|		ПО _ДанныеПоСЧА.СДУ = _ВводыВыводы.СДУ
		|			И _ДанныеПоСЧА.Дата = _ВводыВыводы.Дата
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЗадолженностиПоКомиссии КАК _ЗадолженностиПоКомиссии
		|		ПО _ДанныеПоСЧА.СДУ = _ЗадолженностиПоКомиссии.СДУ
		|			И _ДанныеПоСЧА.Дата = _ЗадолженностиПоКомиссии.Дата
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ЗадолженностиПИФ КАК _ЗадолженностиПИФ
		|		ПО _ДанныеПоСЧА.СДУ = _ЗадолженностиПИФ.СДУ
		|			И _ДанныеПоСЧА.Дата = _ЗадолженностиПИФ.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Итоговая.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Итоговая.Дата КАК Дата,
		|	_Итоговая.ДатаДляСверки КАК ДатаДляСверки,
		|	_Итоговая.Результат КАК Результат,
		|	ВЫБОР
		|		КОГДА _Итоговая.СЧА ЕСТЬ NULL
		|			ТОГДА ""Не удалось определить СЧА""
		|		КОГДА _Итоговая.СЧАДляСверки ЕСТЬ NULL
		|			ТОГДА ""Не удалось определить СЧА для сверки""
		|		КОГДА _Итоговая.Результат = 0
		|			ТОГДА ""СЧА изменилась более чем на "" + &ПроцентОтклоненияСЧАСтрокой + ""%""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Комментарий,
		|	_Итоговая.СЧА КАК СЧА,
		|	_Итоговая.СЧАДляСверки КАК СЧАДляСверки,
		|	ВЫБОР
		|		КОГДА _Итоговая.Результат = 0
		|			ТОГДА _Итоговая.ВводыВыводы
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВводыВыводы,
		|	_Итоговая.РасшифровкаСЧА КАК РасшифровкаСЧА,
		|	_Итоговая.РасшифровкаСЧАДляСверки КАК РасшифровкаСЧАДляСверки
		|ИЗ
		|	_Итоговая КАК _Итоговая
		|ГДЕ
		|	(&ИсключитьУспешноПрошедшихКонтроль
		|				И _Итоговая.Результат = 0
		|			ИЛИ НЕ &ИсключитьУспешноПрошедшихКонтроль)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СчетДоверительногоУправления,
		|	Дата";
	#КонецОбласти
		
КонецФункции

Функция ПолучитьПараметрыВыполненияДляСбораСтатистики()
	
	ПараметрыОбработки = Новый Структура;
	
	ПараметрыОбработки.Вставить("Организация",						Организация);
	ПараметрыОбработки.Вставить("НачалоПериода",					Формат(Период.ДатаНачала, "ДФ=dd.MM.yyyy"));
	ПараметрыОбработки.Вставить("КонецПериода",						Формат(Период.ДатаОкончания, "ДФ=dd.MM.yyyy"));
	ПараметрыОбработки.Вставить("СчетаДоверительногоУправления",	Список.ВыгрузитьКолонку("СчетДоверительногоУправления"));
	
	Описание = "Организация: " + Организация + "
				|Начало периода: " + Формат(Период.ДатаНачала, "ДФ=dd.MM.yyyy") + "
				|Конец периода: " + Формат(Период.ДатаОкончания, "ДФ=dd.MM.yyyy") + "
				|Счета доверительного управления: ";
	
	Для Каждого ТекСтрока Из Список Цикл
		Описание = Описание + ТекСтрока.СчетДоверительногоУправления + ", ";
	КонецЦикла;
	
	Описание = Лев(Описание, СтрДлина(Описание) - 2);
	
	Хранилище = Новый ХранилищеЗначения(ПараметрыОбработки, Новый СжатиеДанных(9));
	
	ПараметрыВыполненияДляСбораСтатистики = Новый Структура("Хранилище, Описание", Хранилище, Описание);
	
	Возврат ПараметрыВыполненияДляСбораСтатистики;
	
КонецФункции

Процедура СформироватьОповещение(РезультатПроверки, Организация, ДатаНачала, ДатаОкончания, ПолучателиОповещения)
	
	// Получаем HTML-текст результата проверки через сохранение во временный файл.
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("htm");
	РезультатПроверки.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
	ТД = Новый ТекстовыйДокумент;
	ТД.Прочитать(ИмяВременногоФайла);
	
	// Формируем оповещение.
	ТемаПисьма = "Результат проверки отклонения СЧА за " + ПредставлениеПериода(НачалоДня(ДатаНачала), КонецДня(ДатаОкончания)) + ". Организация: " + Организация;
	
	Если ЗначениеЗаполнено(ПолучателиОповещения) Тогда
		ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста", ПолучателиОповещения, ТемаПисьма, ТД.ПолучитьТекст(), ТипТекстаПочтовогоСообщения.HTML);
		РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);

	Иначе
		РеквизитыОповещения = Новый Структура("Организация, Тема, Текст", Организация, ТемаПисьма, ТД.ПолучитьТекст());
		Справочники.Оповещения.СформироватьОповещения("Обработка.КонтрольОтклоненияСЧА.ВыполнитьОповещениеОРезультатеПроверки", Перечисления.ТипыСобытий.ВнешнийВызов, РеквизитыОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьОповещение(Экземпляры)
	
	ИсключитьУспешноПрошедшихКонтроль = Истина;
	
	КлючиЗапуска = Новый ТаблицаЗначений;
	
	КлючиЗапуска.Колонки.Добавить("Организация",					Новый ОписаниеТипов("СправочникСсылка.Организации"));
	КлючиЗапуска.Колонки.Добавить("ДатаНачала",						Новый ОписаниеТипов("Дата"));
	КлючиЗапуска.Колонки.Добавить("ДатаОкончания",					Новый ОписаниеТипов("Дата"));
	КлючиЗапуска.Колонки.Добавить("СчетДоверительногоУправления",	Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	КлючиЗапуска.Колонки.Добавить("ПолучателиОповещения",			Новый ОписаниеТипов("Строка"));
	КлючиЗапуска.Колонки.Добавить("ВариантДатыДляСверки",			Новый ОписаниеТипов("Строка"));
	КлючиЗапуска.Колонки.Добавить("ПроцентОтклоненияСЧА",			Новый ОписаниеТипов("Число"));
	КлючиЗапуска.Колонки.Добавить("Идентификатор",					Новый ОписаниеТипов("УникальныйИдентификатор"));
	
	// Фиксируем запуск.
	Для Каждого ТекЭкземпляр Из Экземпляры Цикл
		
		НовыйКлюч = КлючиЗапуска.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовыйКлюч, ТекЭкземпляр.Параметры);
		ЗаполнитьЗначенияСвойств(НовыйКлюч, ТекЭкземпляр); //Идентификатор
		
	КонецЦикла;
	
	ПоляГруппировки = "Организация, ДатаНачала, ДатаОкончания, ПолучателиОповещения, ВариантДатыДляСверки, ПроцентОтклоненияСЧА";
	
	КлючиЗапуска.Свернуть(ПоляГруппировки + ", СчетДоверительногоУправления, Идентификатор");
	
	Группировки = КлючиЗапуска.Скопировать(, ПоляГруппировки);
	Группировки.Свернуть(ПоляГруппировки);
	
	Для Каждого Группировка Из Группировки Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Группировка);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект.Период, Группировка);
		
		ПараметрыОтбора = Новый Структура(ПоляГруппировки);
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Группировка);
		
		ДетальныеЗаписи = КлючиЗапуска.Скопировать(ПараметрыОтбора, "СчетДоверительногоУправления, Идентификатор");
		
		ЭтотОбъект.Список.Загрузить(ДетальныеЗаписи);
		
		// Получаем данные о результатах проверки.
		РезультатПроверки = ПроверитьСписокДоговоров();
																						
		// Если есть счета ДУ, не прошедшие проверку.
		Если РезультатПроверки.Количество() > 0 Тогда
			// Выводим данные в табличный документ.
			СодержаниеОповещения = ВывестиРезультатПроверкиВТабличныйДокумент(РезультатПроверки);
			// Фомрируем оповещение.
			СформироватьОповещение(СодержаниеОповещения, Группировка.Организация, Группировка.ДатаНачала, Группировка.ДатаОкончания, Группировка.ПолучателиОповещения);
		КонецЕсли;
		
		// Фиксируем успешное выполнение задания.
		Для Каждого СтрокаДетальныеЗаписи Из ДетальныеЗаписи Цикл
			Если ЗначениеЗаполнено(СтрокаДетальныеЗаписи.Идентификатор) Тогда
				РаботаСРегламентнымиЗаданиями.ЗафиксироватьВыполнениеОтложенногоЗадания(СтрокаДетальныеЗаписи.Идентификатор);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти
